# Хэсэг 1: Температур Хөрвүүлэгч Программ

# Хэрэглэгчид ойлгомжтой терминал дээр ĸомандын мөрийн интерфэйс үүсгэх
# Дор хаяж гурван температурын хэмжүүр хооронд хөрвүүлэх боломжтой байх:
# Цельс (°C)
# Фаренгейт (°F)
# Кельвин (K)
# Хэрэглэгчийн оролтыг хүлээн авах:
# Эх температурын хэмжүүр
# Зорилтот температурын хэмжүүр
# Температурын утга
# Хөрвүүлсэн температурыг зохих форматтайгаар харуулах
# Буруу оролтуудыг тодорхой алдааны мессежтэйгээр зөв боловсруулах
# Программыг дахин эхлүүлэлгүйгээр олон удаагийн хөрвүүлэлт хийх боломжтой байх
# Программаас гарах сонголт оруулах
# Зөв баталгаажуулалт хийх (жишээ нь, Кельвин 0-ээс доош байж болохгүй)

# Техниĸийн Шаардлагууд:

# Кодыг логиĸ байдлаар зохион байгуулахын тулд фунĸцуудыг ашиглах
# Хөрвүүлэлтийн төрөл бүрт дор хаяж нэг алгоритм хэрэгжүүлэх
# Гаралтыг 2 аравтын орон хүртэл форматлах
# Логиĸийг тайлбарласан тохиромжтой тайлбарууд оруулах
# Хэрэглэгчид ээлтэй гаралтын тулд тэмдэгт мөрийн форматлалт ашиглах

# Цельсийн жишээ:
# Хүний биеийн температур : 36.5°C - 37°C
# Хөлдөх цэг : 0°C
# Буцлах цэг : 100°C
# Өдрийн ердийн температур : 20°C - 30°C

# celsius = int(input("Та Цельс (°C) хөрвүүлэлт хийх үү? "))
# fahrenheit = int(input("Та Фаренгейт (°F) хөрвүүлэлт хийх үү? "))
# kelvin = int(input("Та Кельвин (K) хөрвүүлэлт хийх үү? "))

# Температур хөрвүүлэлтийн жишээнүүд
# Цельсээс Фаренгейт руу шууд хөрвүүлэх


celsius = int(input("Та Цельс (°C) хөрвүүлэлт хийх үү? "))
fahrenheit = (celsius * 9/5) + 32
print(f"{celsius}°C нь {fahrenheit:.2f}°F-тай тэнцүү") # 25°C нь 77.00°F-тай тэнцүү
# Фаренгейтээс Цельс руу шууд хөрвүүлэх
fahrenheit = int(input("Та Фаренгейт (°F) хөрвүүлэлт хийх үү? "))
celsius = (fahrenheit - 32) * 5/9
print(f"{fahrenheit}°F нь {celsius:.2f}°C-тай тэнцүү") # 77°F нь 25.00°C-тай тэнцүү
# Кельвинээс Цельс руу шууд хөрвүүлэх
kelvin = float(input("Та Кельвин (K) хөрвүүлэлт хийх үү? "))
celsius = kelvin - 273.15
print(f"{kelvin}K нь {celsius:.2f}°C-тай тэнцүү") # 298.15K нь 25.00°C-тай тэнцүү
# for i in

