# Хэсэг 1: Температур Хөрвүүлэгч Программ

# Хэрэглэгчид ойлгомжтой терминал дээр ĸомандын мөрийн интерфэйс үүсгэх
# Дор хаяж гурван температурын хэмжүүр хооронд хөрвүүлэх боломжтой байх:
# Цельс (°C)
# Фаренгейт (°F)
# Кельвин (K)
# Хэрэглэгчийн оролтыг хүлээн авах:
# Эх температурын хэмжүүр
# Зорилтот температурын хэмжүүр
# Температурын утга
# Хөрвүүлсэн температурыг зохих форматтайгаар харуулах
# Буруу оролтуудыг тодорхой алдааны мессежтэйгээр зөв боловсруулах
# Программыг дахин эхлүүлэлгүйгээр олон удаагийн хөрвүүлэлт хийх боломжтой байх
# Программаас гарах сонголт оруулах
# Зөв баталгаажуулалт хийх (жишээ нь, Кельвин 0-ээс доош байж болохгүй)

# Техниĸийн Шаардлагууд:

# Кодыг логиĸ байдлаар зохион байгуулахын тулд фунĸцуудыг ашиглах
# Хөрвүүлэлтийн төрөл бүрт дор хаяж нэг алгоритм хэрэгжүүлэх
# Гаралтыг 2 аравтын орон хүртэл форматлах
# Логиĸийг тайлбарласан тохиромжтой тайлбарууд оруулах
# Хэрэглэгчид ээлтэй гаралтын тулд тэмдэгт мөрийн форматлалт ашиглах

# Цельсийн жишээ:
# Хүний биеийн температур : 36.5°C - 37°C
# Хөлдөх цэг : 0°C
# Буцлах цэг : 100°C
# Өдрийн ердийн температур : 20°C - 30°C

celsius = int(input("Та Цельс (°C) хөрвүүлэлт хийх үү? "))
fahrenheit = int(input("Та Фаренгейт (°F) хөрвүүлэлт хийх үү? "))
kelvin = int(input("Та Кельвин (K) хөрвүүлэлт хийх үү? "))

# for i in
